app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_salt", "crypted_password", "persistence_token", "full_name", "single_access_token", "perishable_token", "login_count", "current_login_ip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    @user = User.find(params[:id]) || current_user

    respond_to do |format|
      if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "full_name" = $1, "perishable_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["full_name", "Mirko Cerovak"], ["perishable_token", "Sml1U5B36kV4Zs4nHKO"], ["updated_at", "2016-01-09 19:57:34.283284"], ["id", 3]]

  def change_password
    @user = current_user
    if @user.valid_password?(params[:user][:current_password]) && @user.update(user_params)
---
UPDATE "users" SET "login_count" = $1, "perishable_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["login_count", 4], ["perishable_token", "8G9hOAUmfVOgZRHixAj8"], ["updated_at", "2016-01-11 10:10:56.592195"], ["id", 33]]